JMeter3/HTTP Request.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan">
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group">
        <intProp name="ThreadGroup.num_threads">10</intProp>
        <intProp name="ThreadGroup.ramp_time">1</intProp>
        <longProp name="ThreadGroup.duration">60</longProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">10</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="dialog list">
          <intProp name="HTTPSampler.response_timeout">60000</intProp>
          <stringProp name="HTTPSampler.domain">social-network.local</stringProp>
          <stringProp name="HTTPSampler.path">/dialog/${__CSVRead(dialogs.csv,0)}/list</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Authorization</stringProp>
                <stringProp name="Header.value">Bearer eyJ0eXAiOiJKV1QiLCJhbGciOiJSUzI1NiJ9.eyJpYXQiOjE3NDUxNzg2ODAsImV4cCI6MTc0NTE4MjI4MCwicm9sZXMiOlsiUk9MRV9BRE1JTiJdLCJ1c2VybmFtZSI6IjAxOTQ1NmQwLWU5MjgtN2FiZi1iNWQ4LTkwNjE4NmI5MzRmOSJ9.FWVJ6IKc3RSdtq7Yz3GnoeErmpCP6NTgLpdbzB6DsQdETNfPerOZJgYUz5Kna1wke4OOfV8vq1gkCLSNlNIFRKlwGLxyfF6xYLoErTVAACuREFKCmIlraw8O-g0UlhuZM-4EybocyfZNs_qT4F0mp3hWpD0jpvU2utDPt_5X0ET7ozKZ34KDisRqK54W1fHR67Lf00o7rQHUwAupoVBx5rMz0mYvxRulttkPLRuhWg8vqDVLus7cWPGQPtCjhBBYG4jsKXfc8idIXqH6kyS32KgYxfW9-kdjVOVOydmcJroMXXcdLmQeABbdQYpkk2SUYYJWu4eN-1p_045nQfd1BaiwtF9tFCU0UCW97jCnqFQfIr9Zd3oM3vbWv0kr38O8GkLo22KqyYjJtjSYVeOs0c9QJbYRT8ZlAqWYDmutzoYy2FrRpdpLVpuBUnPQIFoncf4hyhyeJDwbP9V2ji7O-rF5KZp_-JogTqBR_IbdjB8xaR9inssiKcatWUxlIQcOKa8ZifN3fr-qIafCzScdjtZhrAYJEhD0c1iew4X1fr8fbo_IoY6OUNzr4TvXxVvCZ2XpE_jivab4n2Bl_vSIlvWckJ-1mI66SdMXtScJ7GUnZBVCNn1Xg0wq6bSwHfDWibXDYlghRTddBgwC5v65_QOUHUcpjXDYWD1dgeQd6Wc</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
        </hashTree>
      </hashTree>
      <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>